{
    "job": {
        "companyName": "Airbnb",
        "companyLogo": "https://res.cloudinary.com/dxrcsss4k/image/upload/v1750951154/logos/h0aaunilr7bibn0e6pkv.jpg",
        "jobTitle": "Backend Staff Software Engineer, On Trip",
        "jobId": "57ca7138-d3e4-4f51-80cf-dadf523757a8",
        "jobLocation": [
            "United States"
        ],
        "jobType": "hybrid",
        "jobLink": "https://careers.airbnb.com/positions/6580100/",
        "requireSkils": "Java, Kotlin, Backend Development, Microservices, Software Engineering, System Architecture, iOS, Android, Web Development, UX, UI",
        "description": "<p>Airbnb was born in 2007 when two hosts welcomed three guests to their San Francisco home, and has since grown to over 5 million hosts who have welcomed over 2 billion guest arrivals in almost every country across the globe. Every day, hosts offer unique stays and experiences that make it possible for guests to connect with communities in a more authentic way.</p><p><strong>The Community You Will Join:</strong></p><ul><li><p>Airbnb’s On Trip and Wishlist teams are responsible for providing Guests a seamless journey from trip planning to trip end.</p></li><li><p>Product surfaces include Wishlists, Trips tab, and Airbnb’s connected smart lock solution&nbsp;</p></li><li><p>The team is cross-discipline with expertise in iOS, Android, Web, and backend development.&nbsp; We work closely with our partners in design, product, data science, and marketing to deliver a cohesive journey for our Guests in the Airbnb app</p></li></ul><p><strong>The Difference You Will Make:</strong></p><ul><li><p>Explore, shape, and develop new product experiences alongside cross-functional partners (design and product); from ideation to implementation at scale</p></li><li><p>Develop prototypes to validate ideas while proactively considering long-term implications on technical design and architecture</p></li><li><p>Translate prototypes to high quality, scalable, and maintainable production code through iterative development</p></li><li><p>Cross-collaborate across engineering to build new features holistically</p></li></ul><p><strong>A Typical Day:&nbsp;</strong></p><ul><li><p>Work across engineering, product, and design to deliver features in the Trips and Wishlist space for Guests and Hosts</p></li><li><p>Plan, share, align, and execute technical solutions</p></li><li><p>Prototype, facilitate feedback, iterate, and deliver product features and improvements&nbsp;</p></li><li><p>Foster an engineering environment of quality code, relevant documentation, operational excellence, and knowledge sharing</p></li></ul><p><strong>Your Expertise:</strong></p><ul><li><p>9+ years of experience in a hands-on software engineering role in backend development.&nbsp;</p></li><li><p>Bachelor’s and/or Master/PhD’s degree, preferably in CS, or equivalent experience&nbsp;</p></li><li><p>Extensive experience working in Java and/or Kotlin</p></li><li><p>Passionate about efficiency, availability, technical quality and system quality</p></li><li><p>Passionate about design and UX sensibilities</p></li><li><p>Excellent communication and collaboration skills and the ability to work well within engineering organization and cross functions</p></li><li><p>Love collaborating via code reviews, architecture discussions, and are motivated to improve their teammates’ productivity</p></li><li><p>Experience working with a microservice architecture at scale</p></li><li><p>[Bonus] Experience working on a Product team or customer-centric software supporting a medium to large engineering organization</p></li><li><p>[Bonus] Show motivation for personal growth and learning new technologies to support the team’s need</p></li></ul><p><strong>Your Location:</strong></p><p>This position is US - Remote Eligible. The role may include occasional work at an Airbnb office or attendance at offsites, as agreed to with your manager. While the position is Remote Eligible, you must live in a state where Airbnb, Inc. has a registered entity. <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://careers.airbnb.com/\">Click here for the up-to-date list of excluded states. This list is continuously evolving, so please check back with us if the state you live in is on the exclusion list</a> . If your position is employed by another Airbnb entity, your recruiter will inform you what states you are eligible to work from.</p><p><strong>Our Commitment To Inclusion &amp; Belonging:</strong></p><p>Airbnb is committed to working with the broadest talent pool possible. We believe diverse ideas foster innovation and engagement, and allow us to attract creatively-led people, and to develop the best products, services and solutions. All qualified individuals are encouraged to apply.</p><p>We strive to also provide a disability inclusive application and interview process. If you are a candidate with a disability and require reasonable accommodation in order to submit an application, please contact us at: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"mailto:reasonableaccommodations@airbnb.com\">reasonableaccommodations@airbnb.com</a>. Please include your full name, the role you’re applying for and the accommodation necessary to assist you with the recruiting process.&nbsp;</p><p>We ask that you only reach out to us if you are a candidate whose disability prevents you from being able to complete our online application.</p><p><strong>How We'll Take Care of You:</strong></p><p>Our job titles may span more than one career level. The actual base pay is dependent upon many factors, such as: training, transferable skills, work experience, business needs and market demands. The base pay range is subject to change and may be modified in the future. This role may also be eligible for bonus, equity, benefits, and Employee Travel Credits. &nbsp;</p><p>Pay Range</p><p>$204,000—$255,000 USD</p>",
        "matchingSkills": [],
        "jobgenixSuggestion": false,
        "match": "0%"
    }
}